///'use client'
import React from 'react'

function PrivacyPolice() {

    return (
        <section className="information-page">
            <div className="information-page__container _container">
                <div className="information-page__text">
                    <h1>Согласие на обработку персональных данных</h1>
                    <p>1. Общие положения.</p>
                    <p>1.1. Компания
                        <strong>"БРЕНДИНСТРУМЕНТ"</strong>
                        является администратором интернет-сайта brendinstrument.ru (далее - "Сайт") и соблюдает политику
                        конфиденциальности в отношении всех Пользователей и Посетителей Сайта.
                    </p>
                    <p>
                        1.2. Настоящая Политика конфиденциальности разработана в соответствии с законодательством РФ и
                        регулирует обработку персональных данных Пользователей. Она действует в отношении всех данных,
                        которые могут быть получены о Пользователе в процессе использования Сайта.

                    </p>
                    <p>
                        1.3. Использование Сайта означает согласие Пользователя с условиями настоящей Политики
                        конфиденциальности. В случае несогласия с ней, Пользователь должен воздержаться от использования
                        Сайта.
                    </p>
                    <p>
                        2. Предмет и цели Политики конфиденциальности.
                    </p>
                    <p>
                        2.1. Персональные данные предоставляются Пользователем добровольно для идентификации при
                        получении услуг, информации, заказе товаров и других целей. Компания имеет право обрабатывать
                        такие данные для улучшения Сайта, проведения исследований и анализа.
                    </p>
                    <p>

                        2.2. Компания может проверять контактную информацию Пользователя для обеспечения оказания услуг.

                    </p>
                    <p>

                        2.3. Персональные данные подлежат уничтожению или обезличиванию по достижении целей обработки
                        или при утрате необходимости в них.

                    </p>
                    <p>
                        3. Условия обработки персональной информации.
                    </p>
                    <p>
                        3.1. Обработка персональных данных осуществляется законным способом без ограничения срока.
                        Принимаются все необходимые меры защиты данных.
                    </p>
                    <p>
                        3.2. Доступ к данным предоставляется только определенным лицам, соблюдающим правила обработки и
                        защиты данных.
                    </p>
                    <p>
                        3.3. Пользователь имеет право изменить или отозвать свое согласие на обработку данных, направив
                        письмо на указанный адрес электронной почты.
                    </p>
                    <p>
                        Эта Политика конфиденциальности действует в рамках законодательства РФ и обязательна для всех
                        Пользователей Сайта.
                    </p>
                </div>
            </div>
        </section>
    )
}

export default PrivacyPolice