//'use client'
import React from 'react'
import Link from "next/link";

function TermsOfUse() {

    return (
        <section className="information-page">
            <div className="information-page__container _container">
                <div className="information-page__text">
                    <h1>Согласие на обработку персональных данных</h1>
                    <p>1. Определения</p>
                    <p>1.1. Компания
                        Сайт – это информационно-телекоммуникационная сеть Интернет по адресу <Link
                            href={'/'}>brendinstrument.ru</Link>,
                        содержащая текстовую и графическую информацию.

                    </p>
                    <p>
                        Администрация Сайта, Компания – <strong>БРЕНДИНСТРУМЕНТ</strong>

                    </p>
                    <p>
                        Пользователь – любое физическое или юридическое лицо, которое посещает и/или использует
                        сайт <Link href={'/'}>brendinstrument.ru</Link>, способное приобретать гражданские права и нести
                        обязанности в соответствии с законодательством Российской Федерации.

                    </p>
                    <p>
                        Регистрация – процедура, при которой Пользователь подает заявку на получение расширенного
                        функционала услуг и товаров, размещенных на сайте <Link href={'/'}>brendinstrument.ru</Link>.

                    </p>
                    <p>
                        2. Общие условия.

                    </p>
                    <p>

                        2.1. Настоящее Пользовательское соглашение (далее – Соглашение) регулирует отношения между
                        <strong>«БРЕНДИНСТРУМЕНТ»</strong> и Пользователем Сайта.


                    </p>
                    <p>

                        2.2. <strong>«БРЕНДИНСТРУМЕНТ»</strong> оставляет за собой право в любое время изменять,
                        добавлять или удалять
                        пункты настоящего Соглашения без уведомления Пользователя. Пользователь несет ответственность за
                        проверку наличия изменений в Соглашении.


                    </p>
                    <p>
                        2.3. Все Пользователи обязаны ознакомиться с текстом настоящего Соглашения. Использование Сайта
                        означает согласие с условиями Соглашения. Продолжение использования Сайта после изменений в
                        Соглашении означает согласие с новой редакцией.

                    </p>
                    <p>
                        2.4. Соглашение вступает в силу с момента размещения на Сайте и применяется после выражения
                        Пользователем согласия через просмотр Сайта или регистрацию. Пользователь считается принявшим
                        условия Соглашения без оговорок. В случае несогласия, Пользователь должен прекратить
                        использование Сайта.

                    </p>
                    <p>
                        3. Предмет Соглашения.

                    </p>
                    <p>
                        3.1. Предметом Соглашения является пользование Сайтом и получение услуг и товаров.

                    </p>
                    <p>
                        3.2. Под действие Соглашения попадают все услуги и товары Сайта, а также их модификации и новые
                        услуги и товары. Условия получения отдельных услуг и товаров могут быть регулированы
                        специальными условиями, являющимися частью Соглашения.

                    </p>
                    <p>
                        3.3. Настоящее Соглашение является публичной офертой. Пользователь соглашается с условиями
                        Соглашения при работе с Сайтом.
                    </p>
                    <p>
                        3.4. Использование материалов, услуг и товаров Сайта регулируется законодательством Российской
                        Федерации.
                    </p>
                    <p>
                        3.5. Пользователь, как физическое лицо, соглашается на обработку своих персональных данных
                        Администрацией, принимая условия Соглашения.
                    </p>
                </div>
            </div>
        </section>
    )
}

export default TermsOfUse