//'use client'
import React from 'react'

function TermsOfCooperation() {

    return (
        <section className="information-page">
            <div className="information-page__container _container">
                <div className="information-page__text">
                    <h1>Условия сотрудничества</h1>
                    <p>«Бренд-Инструмент» – это платформа, которая занимается скупкой и продажей строительного
                        оборудования, инструментов, которые ранее уже были в употреблении, а также нового. Этот сервис –
                        лучший помощник для людей, которые хотят провести строительные или ремонтные работы без лишних
                        затрат, поэтому отдают предпочтение приобретению электроинструментов б/у. Такие покупки помогут
                        не просто получить необходимый инвентарь для работы, но еще и существенно сэкономить.</p>
                    <p>
                        <strong>Программа лояльности для постоянных клиентов</strong>

                    </p>
                    <p>
                        Компания «Бренд-Инструмент» заинтересована в том, чтобы сотрудничество с организациями было не
                        только плодотворным, но и долговременным. В связи с этим создана программа лояльности для
                        постоянных клиентов.
                    </p>
                    <p>
                        Система скидок
                    </p>
                    <p>
                        При обращении в компанию клиент может быть уверенным в том, что он получит только
                        высококачественное строительное оборудование, индивидуальный подход, лучший сервис и гибкую
                        ценовую политику. Работа компании полностью ориентирована на потребности клиентов.
                    </p>
                    <p>
                        <strong> Как стать клиентом</strong>
                    </p>
                    <p>
                        Чтобы выбрать и приобрести оборудование, необходимо выполнить следующие действия:
                    </p>
                    <ul >
                        <li className='term-corporation-list'>
                            Перейти на официальный сайт компании.
                        </li>
                        <li className='term-corporation-list'>
                            Зайти в «Каталог».
                        </li>
                        <li className='term-corporation-list'>
                            Выбрать необходимый раздел среди всех инструментов – как ручных, так и электрических. В
                            интернет-магазине представлено оборудование от разных торговых марок, в том числе и самых
                            известных: Makita, Hilti, Bosch и др.;
                        </li>
                        <li className='term-corporation-list'>
                            Выбрать понравившуюся продукцию и перейти в карточку товара. Изучить описание: общее
                            состояние, его технические характеристики, стоимость.
                        </li>
                        <li className='term-corporation-list'>
                            Указать количество штук.
                        </li>
                        <li className='term-corporation-list'>
                            Нажать кнопку «Купить».
                        </li>
                    </ul>
                    <p>
                        Дальше только остается полностью оформить заявку, выбрав подходящий вариант доставки. Оплата
                        осуществляется наличным и безналичным способом. При необходимости обратитесь к консультантам.
                        Главные эксперты компании ответят на все интересующие вопросы и помогут подобрать необходимую
                        модель оборудования с учетом объема и вида запланированных работ.


                    </p>
                    <p>
                        Склады располагаются по Москве, поэтому доставка осуществляется в короткие сроки. Цены на
                        оборудование б/у намного ниже, чем на новое, при этом качественные характеристики практически
                        идентичные, что делает покупку максимально выгодной. Благодаря сервису ремонт и стройка уже не
                        будут такими затратными. Вам не придется часами искать инструменты, так как все необходимое для
                        любых работ собрано на платформе. После использования вы всегда можете его продать с помощью
                        сервиса.


                    </p>
                </div>
            </div>
        </section>
    )
}

export default TermsOfCooperation