"use client"
import Link from 'next/link'
import { useRouter } from 'next/router'
import React, { useEffect } from 'react'
import { useDispatch, useSelector } from 'react-redux'
import { logOut, selectUsers } from '../../store/slices/users/usersSlice'

function MyRoomMenu() {
    const dispatch = useDispatch()
    const router = useRouter()
    const {pathname} = router
    const {usersData} = useSelector(selectUsers)
    // useEffect(() => {
    //     if(!usersData.name) {
    //         // router.push("/")
    //     } 
    // }, [router])
    return (
        <div className="myroom-menu">
            <Link href="/personalRoom" className={`myroom-menu__item ${pathname === "/personalRoom" ? "active" : ""}`}>
                <span>
                    <svg width={20} height={20} viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fillRule="evenodd" clipRule="evenodd" d="M7.91678 10.4616C10.2123 10.4616 12.0523 8.59771 12.0523 6.27253C12.0523 3.94735 10.2123 2.0835 7.91678 2.0835C5.6213 2.0835 3.78125 3.94735 3.78125 6.27253C3.78125 8.59771 5.6213 10.4616 7.91678 10.4616ZM7.91602 12.5128C4.54454 12.5128 1.66602 13.0519 1.66602 15.2055C1.66602 17.3583 4.52702 17.9168 7.91602 17.9168C11.2867 17.9168 14.166 17.3778 14.166 15.2241C14.166 13.0705 11.305 12.5128 7.91602 12.5128ZM16.5803 7.99001H17.5829C17.9956 7.99001 18.332 8.33121 18.332 8.74969C18.332 9.16816 17.9956 9.50937 17.5829 9.50937H16.5803V10.4904C16.5803 10.9089 16.2447 11.2501 15.8312 11.2501C15.4185 11.2501 15.082 10.9089 15.082 10.4904V9.50937H14.0812C13.6676 9.50937 13.332 9.16816 13.332 8.74969C13.332 8.33121 13.6676 7.99001 14.0812 7.99001H15.082V7.0098C15.082 6.59133 15.4185 6.25012 15.8312 6.25012C16.2447 6.25012 16.5803 6.59133 16.5803 7.0098V7.99001Z" fill="white" />
                    </svg>
                </span>
                Моя учетная запись
            </Link>
            <Link href="/orders" className={`myroom-menu__item ${pathname === "/orders" ? "active" : ""}`}>
                <span>
                    <svg width={20} height={20} viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fillRule="evenodd" clipRule="evenodd" d="M14.1093 5.83341C14.1357 5.77435 14.1482 5.70999 14.1455 5.64535H14.1673C14.0741 3.42167 12.2381 1.66675 10.0048 1.66675C7.77148 1.66675 5.93542 3.42167 5.84222 5.64535C5.83124 5.70756 5.83124 5.7712 5.84222 5.83341H5.77643C4.70851 5.83341 3.56695 6.53839 3.23553 8.43348L2.58742 13.5957C2.05715 17.3859 4.00885 18.3334 6.55711 18.3334H13.4654C16.0063 18.3334 17.8991 16.9614 17.4277 13.5957L16.787 8.43348C16.3966 6.59145 15.2919 5.83341 14.2387 5.83341H14.1093ZM12.9117 5.83341C12.8885 5.77337 12.8762 5.70969 12.8754 5.64535C12.8754 4.04744 11.5755 2.75207 9.97211 2.75207C8.36868 2.75207 7.06885 4.04744 7.06885 5.64535C7.07984 5.70756 7.07984 5.7712 7.06885 5.83341H12.9117Z" fill="white" />
                    </svg>
                </span>
                История заказов
            </Link>
            <Link href="/resetpass" className={`myroom-menu__item ${pathname === "/resetpass" ? "active" : ""}`}>
                <span>
                    <svg width={22} height={22} viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fillRule="evenodd" clipRule="evenodd" d="M7.54121 7.9853H14.8793C17.0402 7.9853 18.7923 9.6991 18.7923 11.8129V16.3393C18.7923 18.453 17.0402 20.1668 14.8793 20.1668H7.12112C4.96106 20.1668 3.20898 18.453 3.20898 16.3393V11.8129C3.20898 10.0745 4.40125 8.62308 6.02386 8.15659L5.92233 8.16844V6.77171C5.94096 4.0484 8.20534 1.8335 10.9811 1.8335C13.1514 1.8335 15.0693 3.17374 15.7772 5.15904C15.8517 5.35949 15.8331 5.57815 15.7399 5.76949C15.6468 5.96082 15.48 6.1066 15.2742 6.17129C14.855 6.31615 14.3893 6.0984 14.231 5.67929C13.7559 4.32993 12.4528 3.42794 10.9997 3.42794C9.09861 3.42794 7.56263 4.92307 7.55238 6.75348V7.98348L7.54121 7.9853ZM10.996 15.8846C11.4524 15.8846 11.8156 15.5293 11.8156 15.0828V13.0602C11.8156 12.6228 11.4524 12.2675 10.996 12.2675C10.5489 12.2675 10.1856 12.6228 10.1856 13.0602V15.0828C10.1856 15.5293 10.5489 15.8846 10.996 15.8846Z" fill="white" />
                    </svg>
                </span>
                Изменить пароль
            </Link>
            <div className='myroom-menu__button'> 
                <Link href="/" onClick={() => {
                    dispatch(logOut())
                }} >Выйти</Link>
            </div>
        </div>
    )
}

export default MyRoomMenu