import React from 'react'

function CatalogAbaut() {
    return (
        <section className="catalog-abaut">
            <div className="catalog-abaut__container _container">
                <div className="catalog-abaut__flex">
                    <h2>Обычно ищут вместе</h2>
                    <div className="catalog-abaut__buttons">
                        <a href="#">Перфораторы</a>
                        <a href="#">Гайковерты</a>
                        <a href="#">Шуруповерты</a>
                        <a href="#">Заклепочники</a>
                        <a href="#">Сварочные аппараты</a>
                    </div>
                </div>
                <div className="catalog-abaut__flex">
                    <h2>Дрели и шуруповерты</h2>
                    <div className="catalog-abaut__text">
                        <p>Дрели и шуруповерты – это ключевые инструменты, которые используются во многих отраслях: от строительства до мебельного производства. Понимание их основных характеристик, применений и критериев выбора помогает обеспечить эффективность работы и качество выполненных работ. Это дает возможность выбрать модели, которые точно подойдут под требования владельца. Качественные дрели и шуруповерты по отличной стоимости можно заказать в Москве в нашем интернет-магазине. <br />Дрели – это мощные инструменты, используемые для сверления отверстий в различных материалах, включая древесину, металл, пластик и бетон. Они могут быть сетевыми, аккумуляторными или пневматическими и обычно оснащены регулируемой скоростью вращения и функцией ударного сверления для работы с твердыми материалами. Можно купить дрели и шуруповерты в Москве по выгодным условиям для производства или бытовых нужд. <br />Шуруповерты – это устройства, предназначенные для закручивания и откручивания винтов. Они обычно бывают аккумуляторными, обеспечивают мобильность и удобство использования. Шуруповерты оснащаются регулируемым крутящим моментом и вращающимся патроном, что позволяет использовать их с различными насадками и битами. Заказать такой инструмент по отличной цене можно для мастерских или дома.</p>
                    </div>
                </div>
            </div>
        </section>
    )
}

export default CatalogAbaut